// Copyright © 2023 Andy Goryachev <andy@goryachev.com>
package goryachev.mp3player.db;
import goryachev.common.util.CKit;
import goryachev.common.util.CList;
import goryachev.common.util.CMap;
import goryachev.common.util.CSet;
import goryachev.common.util.CSorter;
import goryachev.common.util.D;
import java.io.File;


/**
 * Collects Russian Statistics.
 */
public class CollectRussianStatistics
{
	// https://yadro-servis.ru/blog/nevosmosnoe-sochetanie-bukv/
	// low frequency:
	// ёё|ёщ|ыё|ёу|йэ|гъ|кщ|щф|щз|эщ|щк|гщ|щп|щт|щш|щг|щм|фщ|щл|щд|дщ|ьэ|чц|вй|ёц|ёэ|ёа|йа|шя|шы|ёе|йё|гю|хя|йы|ця|гь|сй|хю|хё|ёи|ёо|яё
	// invalid:
	// ёя|ёь|ёэ|ъж|эё|ъд|цё|уь|щч|чй|шй|шз|ыф|жщ|жш|жц|ыъ|ыэ|ыю|ыь|жй|ыы|жъ|жы|ъш|пй|ъщ|зщ|ъч|ъц|ъу|ъф|ъх|ъъ|ъы|ыо|жя|зй|ъь|ъэ|ыа|нй|еь|цй|ьй|ьл|ьр|пъ|еы|еъ|ьа|шъ|ёы|ёъ|ът|щс|оь|къ|оы|щх|щщ|щъ|щц|кй|оъ|цщ|лъ|мй|шщ|ць|цъ|щй|йь|ъг|иъ|ъб|ъв|ъи|ъй|ъп|ър|ъс|ъо|ън|ък|ъл|ъм|иы|иь|йу|щэ|йы|йъ|щы|щю|щя|ъа|мъ|йй|йж|ьу|гй|эъ|уъ|аь|чъ|хй|тй|чщ|ръ|юъ|фъ|уы|аъ|юь|аы|юы|эь|эы|бй|яь|ьы|ьь|ьъ|яъ|яы|хщ|дй|фй
	public static void main(String[] args) throws Exception
	{
		generateStats();
		// CollectRussianStatistics$Stats.print:109 [аъ, аы, аь, ая, бй, бп, бф, бя, вй, вэ, вя, гг, гж, гй, гп, гх, гц, гщ, гъ, гы, гь, гэ, гя, дй, дф, дщ, дя, еъ, еы, еь, еэ, ея, жз, жй, жф, жх, жш, жщ, жъ, жы, жя, зй, зп, зф, зх, зщ, зэ, зя, иъ, иы, иь, ия, йа, йж, йи, йй, йр, йу, йщ, йъ, йы, йь, йэ, йю, йя, йё, кй, кф, кщ, къ, кь, кэ, кя, лй, лр, лц, лъ, лэ, ля, мд, мж, мй, мъ, мя, нй, нп, нэ, ня, оъ, оы, оь, оя, пж, пй, пм, пф, пх, пъ, пя, рй, ръ, ря, сй, сщ, ся, тй, тя, уъ, уы, уь, уя, уё, фб, фг, фд, фж, фз, фй, фк, фп, фх, фц, фщ, фъ, фя, хб, хж, хй, хф, хх, хщ, хы, хь, хю, хя, хё, цб, цж, цз, цй, цн, цр, цф, цх, цч, цщ, цъ, цэ, цю, ця, цё, чб, чг, чд, чз, чй, чп, чс, чц, чщ, чъ, чы, чэ, чю, чя, шб, шг, шд, шж, шз, шй, шф, шх, шч, шш, шщ, шъ, шы, шэ, шя, щб, щв, щг, щд, щж, щз, щй, щк, щл, щм, щп, щс, щт, щф, щх, щц, щч, щш, щщ, щъ, щы, щэ, щю, щя, ъа, ъб, ъв, ъг, ъд, ъж, ъз, ъи, ъй, ък, ъл, ъм, ън, ъо, ъп, ър, ъс, ът, ъу, ъф, ъх, ъц, ъч, ъш, ъщ, ъъ, ъы, ъь, ъэ, ъя, ъё, ыа, ыо, ыф, ыъ, ыы, ыь, ыэ, ыю, ыя, ыё, ьж, ьй, ьл, ьр, ьу, ьъ, ьы, ьь, ья, эа, эе, эж, эи, эу, эц, эч, эщ, эъ, эы, эь, эю, эя, эё, юо, юу, юъ, юы, юь, юэ, юя, юё, яа, яб, яв, яг, яд, яе, яж, яз, яи, яй, як, ял, ям, ян, яо, яп, яр, яс, ят, яу, яф, ях, яц, яч, яш, ящ, яъ, яы, яь, яэ, яю, яя, яё, ёа, ёе, ёи, ёй, ёо, ёп, ёу, ёф, ёх, ёц, ёч, ёщ, ёъ, ёы, ёь, ёэ, ёю, ёя, ёё]
	}
	
	
	public static void generateStats() throws Exception
	{
		String text = CKit.readString(new File("D:/Vault/Books/Russian/Brodsky/Brodsky - Poetry.txt"));
		Stats st = new Stats(text);
		st.generate();
		st.print();
	}

	
	protected static boolean isRussianLowercase(char c)
	{
		if((c >= 0x0430) && (c < 0x044f))
		{
			return true;
		}
		else if(c == 0x0451)
		{
			return true;
		}
		return false;
	}
	
	
	protected static String mkString(char[] buf, char c1, char c2)
	{
		buf[0] = c1;
		buf[1] = c2;
		return new String(buf);
	}
	
	
	//
	
	
	protected static class Ctr implements Comparable<Ctr>
	{
		public final String text;
		public int count;
		
		
		public Ctr(String text)
		{
			this.text = text;
		}


		public int compareTo(Ctr x)
		{
			int d = x.count - count;
			if(d == 0)
			{
				return x.text.compareTo(text);
			}
			return d;
		}
	}
	
	
	protected static class Stats
	{
		private final String text;
		private final CSet<String> transitions;
		private final CMap<String,Ctr> freq = new CMap<>();
		
		
		public Stats(String text)
		{
			this.text = text;
			this.transitions = generateAll();
		}
		
		
		private CSet<String> generateAll()
		{
			String all = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
			CSet<String> set = new CSet<>();
			char[] ch = new char[2];
			for(int i=0; i<all.length(); i++)
			{
				for(int j=0; j<all.length(); j++)
				{
					String s = mkString(ch, all.charAt(i), all.charAt(j));
					set.add(s);
				}
			}
			return set;
		}


		public void generate()
		{
			char[] ch = new char[2];
			char prev = 0;
			for(char c: text.toCharArray())
			{
				c = Character.toLowerCase(c);
				
				if(isRussianLowercase(prev) && isRussianLowercase(c))
				{
					String s = mkString(ch, prev, c);
					transitions.remove(s);
					
					Ctr ctr = freq.get(s);
					if(ctr == null)
					{
						ctr = new Ctr(s);
						freq.put(s, ctr);
					}
					ctr.count++;
				}
				
				prev = c;
			}
		}
		
		
		public void print2()
		{
			CList<String> t = new CList<>(transitions);
			CSorter.sort(t);
			D.print(t);
		}
		
		
		public void print()
		{
			CList<Ctr> cts = new CList<>(freq.values());
			CSorter.sort(cts);
			
			long total = 0;
			for(Ctr c: cts)
			{
				total += c.count;
			}
			
			for(Ctr c: cts)
			{
				D.p(String.format("%s  %d  %.4f", c.text, c.count, c.count / (float)total));
			}
			
			for(Ctr c: cts)
			{
				if((c.count / (float)total) > 0.0014)
				{
					System.out.print("|" + c.text);
				}
			}
			
			/*
ст  12167  0.0197
то  10320  0.0167
не  9763  0.0158
но  8978  0.0145
на  8759  0.0142
по  7591  0.0123
ра  7504  0.0121
ет  7389  0.0119
ро  7100  0.0115
ка  6808  0.0110
во  6667  0.0108
ре  6481  0.0105
ко  6386  0.0103
ер  6254  0.0101
ть  5783  0.0093
ни  5725  0.0092
ен  5645  0.0091
ве  5622  0.0091
ос  5565  0.0090
ол  5560  0.0090
пр  5453  0.0088
от  5453  0.0088
ли  5384  0.0087
ор  5299  0.0086
та  5089  0.0082
го  4955  0.0080
ов  4910  0.0079
ом  4803  0.0078
те  4730  0.0076
ле  4726  0.0076
од  4577  0.0074
ой  4575  0.0074
ес  4568  0.0074
ло  4563  0.0074
ва  4428  0.0072
ак  4402  0.0071
ит  4292  0.0069
да  4282  0.0069
ал  4237  0.0068
ем  4188  0.0068
за  4155  0.0067
ла  3992  0.0064
де  3968  0.0064
ел  3930  0.0063
он  3910  0.0063
ри  3857  0.0062
ль  3784  0.0061
ме  3705  0.0060
ат  3614  0.0058
ны  3510  0.0057
ас  3463  0.0056
ан  3430  0.0055
ти  3407  0.0055
мо  3396  0.0055
тр  3356  0.0054
ам  3321  0.0054
че  3275  0.0053
ск  3253  0.0053
се  3104  0.0050
ог  2996  0.0048
об  2982  0.0048
ин  2961  0.0048
до  2940  0.0047
ав  2799  0.0045
бе  2772  0.0045
тв  2768  0.0045
ей  2674  0.0043
ки  2671  0.0043
ви  2637  0.0043
же  2575  0.0042
сл  2549  0.0041
ру  2530  0.0041
ар  2519  0.0041
бо  2462  0.0040
им  2433  0.0039
пе  2415  0.0039
вс  2371  0.0038
кр  2358  0.0038
чт  2357  0.0038
ты  2356  0.0038
из  2346  0.0038
ед  2320  0.0037
ми  2280  0.0037
ок  2273  0.0037
ад  2260  0.0037
ил  2249  0.0036
ис  2204  0.0036
нн  2196  0.0035
аз  2192  0.0035
ма  2182  0.0035
со  2166  0.0035
ди  2147  0.0035
вы  2080  0.0034
нь  2077  0.0034
ае  2070  0.0033
ив  1951  0.0032
их  1905  0.0031
ик  1896  0.0031
хо  1887  0.0030
ый  1886  0.0030
тс  1871  0.0030
ну  1869  0.0030
ше  1865  0.0030
ег  1858  0.0030
сь  1851  0.0030
па  1835  0.0030
ев  1817  0.0029
ус  1809  0.0029
ду  1785  0.0029
оч  1762  0.0028
ут  1744  0.0028
бы  1744  0.0028
уд  1741  0.0028
жи  1723  0.0028
ча  1721  0.0028
дн  1707  0.0028
св  1703  0.0028
гл  1697  0.0027
ез  1696  0.0027
ши  1631  0.0026
ож  1625  0.0026
ек  1617  0.0026
ту  1601  0.0026
зн  1590  0.0026
ку  1589  0.0026
чи  1588  0.0026
оз  1584  0.0026
сп  1566  0.0025
мн  1514  0.0024
сн  1503  0.0024
еб  1469  0.0024
ры  1466  0.0024
ще  1431  0.0023
пл  1431  0.0023
са  1429  0.0023
эт  1422  0.0023
лу  1413  0.0023
му  1385  0.0022
ах  1371  0.0022
гр  1344  0.0022
бу  1328  0.0021
зд  1320  0.0021
ий  1310  0.0021
ое  1300  0.0021
бр  1283  0.0021
мы  1282  0.0021
си  1280  0.0021
ид  1268  0.0020
еч  1261  0.0020
оп  1245  0.0020
гд  1206  0.0019
ых  1191  0.0019
шь  1189  0.0019
уж  1185  0.0019
лю  1184  0.0019
аю  1172  0.0019
ир  1149  0.0019
су  1146  0.0019
др  1145  0.0018
ум  1133  0.0018
тн  1129  0.0018
га  1128  0.0018
рт  1114  0.0018
вн  1110  0.0018
уг  1089  0.0018
зв  1084  0.0018
пу  1079  0.0017
пи  1078  0.0017
ье  1069  0.0017
жа  1053  0.0017
рн  1026  0.0017
иц  1020  0.0016
аж  1014  0.0016
лы  1011  0.0016
ие  1005  0.0016
иш  1004  0.0016
ым  986  0.0016
чн  977  0.0016
бл  970  0.0016
см  969  0.0016
ич  949  0.0015
еп  943  0.0015
ыл  941  0.0015
ул  929  0.0015
ыв  928  0.0015
еж  919  0.0015
щи  915  0.0015
еш  914  0.0015
ба  907  0.0015
дв  906  0.0015
ее  901  0.0015
вр  897  0.0014
уч  877  0.0014
ца  873  0.0014
кл  860  0.0014
ют  859  0.0014
ап  858  0.0014
ук  855  0.0014
ач  848  0.0014
ву  843  0.0014
ша  835  0.0013
жд  830  0.0013
ке  828  0.0013
ды  827  0.0013
ьн  822  0.0013
вш  800  0.0013
ай  776  0.0013
чь  773  0.0012
це  771  0.0012
ьс  767  0.0012
аш  756  0.0012
аб  743  0.0012
зе  724  0.0012
чу  718  0.0012
ои  711  0.0011
аг  710  0.0011
кт  705  0.0011
уш  704  0.0011
гу  692  0.0011
дь  691  0.0011
ью  686  0.0011
ьк  686  0.0011
ые  683  0.0011
уб  673  0.0011
жн  673  0.0011
ур  671  0.0011
ух  669  0.0011
зо  662  0.0011
би  660  0.0011
ув  656  0.0011
тк  656  0.0011
ги  652  0.0011
сс  650  0.0011
ую  641  0.0010
рь  624  0.0010
ещ  598  0.0010
ою  595  0.0010
ыт  593  0.0010
вз  589  0.0010
иб  581  0.0009
уп  570  0.0009
дл  560  0.0009
ыш  553  0.0009
ыс  552  0.0009
нт  547  0.0009
зи  541  0.0009
вл  539  0.0009
ох  528  0.0009
юб  518  0.0008
ща  518  0.0008
ущ  518  0.0008
рк  515  0.0008
иг  512  0.0008
лк  510  0.0008
кн  499  0.0008
чк  493  0.0008
зг  487  0.0008
ьш  485  0.0008
ха  481  0.0008
нс  476  0.0008
ош  467  0.0008
зр  447  0.0007
лс  443  0.0007
жу  440  0.0007
сы  437  0.0007
вд  437  0.0007
шу  435  0.0007
лн  435  0.0007
иж  432  0.0007
ун  421  0.0007
нц  420  0.0007
вь  418  0.0007
ющ  412  0.0007
йс  404  0.0007
ех  398  0.0006
вп  398  0.0006
ци  395  0.0006
рд  392  0.0006
уе  388  0.0006
нк  388  0.0006
мл  388  0.0006
кв  385  0.0006
зу  380  0.0006
ии  377  0.0006
гн  368  0.0006
уз  367  0.0006
ге  367  0.0006
ьм  362  0.0006
зы  362  0.0006
фо  360  0.0006
дс  356  0.0006
зл  354  0.0006
шн  351  0.0006
ащ  351  0.0006
ец  344  0.0006
сч  338  0.0005
бн  335  0.0005
цы  334  0.0005
шк  328  0.0005
пы  326  0.0005
ср  320  0.0005
зм  316  0.0005
ыр  314  0.0005
рс  311  0.0005
ощ  310  0.0005
юд  298  0.0005
ип  295  0.0005
фе  293  0.0005
ын  290  0.0005
шл  290  0.0005
рв  284  0.0005
тл  278  0.0004
йн  273  0.0004
нд  269  0.0004
вт  265  0.0004
фи  263  0.0004
хр  253  0.0004
рм  251  0.0004
хи  250  0.0004
зь  250  0.0004
цо  245  0.0004
рж  242  0.0004
юс  241  0.0004
ыб  241  0.0004
дк  237  0.0004
ьи  225  0.0004
ык  221  0.0004
лл  217  0.0004
кс  215  0.0003
рю  211  0.0003
рх  210  0.0003
оф  210  0.0003
фа  209  0.0003
пт  208  0.0003
ию  208  0.0003
зб  208  0.0003
вк  206  0.0003
дц  205  0.0003
цв  198  0.0003
рб  197  0.0003
хл  195  0.0003
сх  192  0.0003
мр  192  0.0003
ищ  192  0.0003
бщ  190  0.0003
хн  189  0.0003
рг  186  0.0003
рш  185  0.0003
сю  181  0.0003
нч  181  0.0003
ху  180  0.0003
ьц  179  0.0003
шо  178  0.0003
ио  178  0.0003
иа  177  0.0003
чш  175  0.0003
ьб  174  0.0003
хв  174  0.0003
оо  172  0.0003
мп  172  0.0003
дт  171  0.0003
нг  170  0.0003
рл  169  0.0003
щу  164  0.0003
бс  163  0.0003
иф  162  0.0003
ео  162  0.0003
рч  161  0.0003
лж  161  0.0003
ею  161  0.0003
йт  159  0.0003
йд  157  0.0003
цу  156  0.0003
мс  152  0.0002
лч  151  0.0002
ню  150  0.0002
бв  149  0.0002
аф  147  0.0002
тч  146  0.0002
лт  142  0.0002
ып  141  0.0002
пь  141  0.0002
ьт  135  0.0002
ыч  135  0.0002
пн  135  0.0002
мк  135  0.0002
бь  133  0.0002
ьз  131  0.0002
зж  131  0.0002
ыд  130  0.0002
рц  130  0.0002
вм  129  0.0002
зк  128  0.0002
юч  127  0.0002
сд  127  0.0002
фр  120  0.0002
рп  119  0.0002
бк  117  0.0002
уй  115  0.0002
еу  115  0.0002
пк  114  0.0002
бъ  112  0.0002
ау  112  0.0002
еи  111  0.0002
рз  109  0.0002
лг  109  0.0002
йч  108  0.0002
аи  108  0.0002
лм  107  0.0002
ац  107  0.0002
шт  106  0.0002
ыг  104  0.0002
йк  103  0.0002
юн  102  0.0002
сш  100  0.0002
тт  99  0.0002
жь  99  0.0002
еа  98  0.0002
сё  97  0.0002
чо  95  0.0002
жо  95  0.0002
дм  95  0.0002
сб  94  0.0002
щь  93  0.0002
мм  93  0.0002
ъе  92  0.0001
вв  92  0.0001
мь  91  0.0001
мб  91  0.0001
мг  88  0.0001
нв  87  0.0001
юр  86  0.0001
ыз  86  0.0001
лд  86  0.0001
оэ  82  0.0001
гк  80  0.0001
пч  78  0.0001
дж  78  0.0001
ао  75  0.0001
тю  74  0.0001
оц  73  0.0001
дш  73  0.0001
лп  72  0.0001
вх  71  0.0001
фл  70  0.0001
вч  70  0.0001
жж  69  0.0001
хе  68  0.0001
йм  68  0.0001
тб  67  0.0001
ьд  66  0.0001
лв  65  0.0001
сц  62  0.0001
мч  60  0.0001
жк  60  0.0001
тп  59  0.0001
йз  59  0.0001
вц  59  0.0001
юл  58  0.0001
лз  57  0.0001
дп  57  0.0001
аа  57  0.0001
хт  56  0.0001
тд  56  0.0001
хм  55  0.0001
нз  55  0.0001
еф  55  0.0001
сф  54  0.0001
вг  54  0.0001
юг  53  0.0001
эх  52  0.0001
хс  51  0.0001
юк  50  0.0001
рр  50  0.0001
эл  49  0.0001
кш  49  0.0001
йц  49  0.0001
сг  48  0.0001
тм  47  0.0001
пп  46  0.0001
оу  46  0.0001
нр  46  0.0001
эр  45  0.0001
эк  45  0.0001
рщ  45  0.0001
уф  44  0.0001
мв  44  0.0001
иу  44  0.0001
эп  43  0.0001
ьг  42  0.0001
ыж  42  0.0001
юм  41  0.0001
шв  41  0.0001
уи  41  0.0001
вб  41  0.0001
щн  40  0.0001
кж  40  0.0001
ьч  39  0.0001
дб  39  0.0001
шп  38  0.0001
уа  38  0.0001
тц  38  0.0001
сж  37  0.0001
рф  36  0.0001
зз  35  0.0001
пс  34  0.0001
ьв  33  0.0001
ыщ  33  0.0001
нщ  33  0.0001
эм  32  0.0001
цк  32  0.0001
дд  32  0.0001
лб  31  0.0001
зш  31  0.0001
гч  30  0.0000
юз  29  0.0000
юв  29  0.0000
гв  28  0.0000
фы  27  0.0000
кз  27  0.0000
дъ  27  0.0000
мф  26  0.0000
жч  26  0.0000
жм  26  0.0000
бж  25  0.0000
ён  24  0.0000
шм  24  0.0000
фт  24  0.0000
лё  24  0.0000
дч  24  0.0000
вщ  24  0.0000
юю  23  0.0000
чл  23  0.0000
фу  23  0.0000
гс  23  0.0000
бю  23  0.0000
бб  23  0.0000
хш  22  0.0000
нж  22  0.0000
кк  22  0.0000
жб  22  0.0000
фм  21  0.0000
тш  21  0.0000
аэ  21  0.0000
эй  20  0.0000
уэ  20  0.0000
гт  20  0.0000
бм  20  0.0000
ьп  19  0.0000
тщ  19  0.0000
сз  19  0.0000
кц  19  0.0000
юж  18  0.0000
эс  18  0.0000
чр  18  0.0000
оа  18  0.0000
лф  18  0.0000
йш  18  0.0000
ёт  17  0.0000
эн  17  0.0000
ыц  17  0.0000
рё  17  0.0000
пц  17  0.0000
бх  17  0.0000
эв  16  0.0000
нф  16  0.0000
нм  16  0.0000
лх  16  0.0000
жг  16  0.0000
дю  16  0.0000
дх  16  0.0000
ёр  15  0.0000
уу  15  0.0000
дз  15  0.0000
бц  15  0.0000
бд  15  0.0000
бг  15  0.0000
ёк  14  0.0000
шц  14  0.0000
фф  14  0.0000
уц  14  0.0000
зт  14  0.0000
бз  14  0.0000
уо  13  0.0000
тх  13  0.0000
йб  13  0.0000
юц  12  0.0000
юп  12  0.0000
чв  12  0.0000
съ  12  0.0000
юш  11  0.0000
эф  11  0.0000
мц  11  0.0000
мз  11  0.0000
жр  11  0.0000
бш  11  0.0000
ёз  10  0.0000
ьё  10  0.0000
ьф  10  0.0000
тф  10  0.0000
тг  10  0.0000
йо  10  0.0000
йл  10  0.0000
жт  10  0.0000
дг  10  0.0000
вё  10  0.0000
юй  9  0.0000
эз  9  0.0000
эд  9  0.0000
ьх  9  0.0000
чё  9  0.0000
тз  9  0.0000
зъ  9  0.0000
юх  8  0.0000
ыи  8  0.0000
пю  8  0.0000
пш  8  0.0000
оё  8  0.0000
нё  8  0.0000
нш  8  0.0000
зс  8  0.0000
её  8  0.0000
бт  8  0.0000
ём  7  0.0000
ёл  7  0.0000
ёж  7  0.0000
эг  7  0.0000
ьо  7  0.0000
щё  7  0.0000
нл  7  0.0000
дё  7  0.0000
шю  6  0.0000
шр  6  0.0000
чм  6  0.0000
цц  6  0.0000
фь  6  0.0000
пщ  6  0.0000
жс  6  0.0000
гш  6  0.0000
ёд  5  0.0000
юе  5  0.0000
що  5  0.0000
фв  5  0.0000
тё  5  0.0000
тъ  5  0.0000
мё  5  0.0000
мщ  5  0.0000
мш  5  0.0000
йг  5  0.0000
гё  5  0.0000
гм  5  0.0000
гб  5  0.0000
бч  5  0.0000
аё  5  0.0000
ёс  4  0.0000
ёб  4  0.0000
юи  4  0.0000
щр  4  0.0000
фш  4  0.0000
фч  4  0.0000
нх  4  0.0000
мх  4  0.0000
кх  4  0.0000
кг  4  0.0000
йф  4  0.0000
йе  4  0.0000
жл  4  0.0000
ёв  3  0.0000
эо  3  0.0000
шс  3  0.0000
цм  3  0.0000
цл  3  0.0000
хц  3  0.0000
хз  3  0.0000
фс  3  0.0000
фн  3  0.0000
рэ  3  0.0000
пд  3  0.0000
мэ  3  0.0000
мт  3  0.0000
лщ  3  0.0000
кё  3  0.0000
кд  3  0.0000
иё  3  0.0000
зч  3  0.0000
зц  3  0.0000
жё  3  0.0000
жэ  3  0.0000
жв  3  0.0000
вю  3  0.0000
въ  3  0.0000
ёш  2  0.0000
ёг  2  0.0000
эб  2  0.0000
ьа  2  0.0000
шё  2  0.0000
чф  2  0.0000
цш  2  0.0000
цт  2  0.0000
хэ  2  0.0000
хч  2  0.0000
хп  2  0.0000
хг  2  0.0000
фю  2  0.0000
фэ  2  0.0000
тэ  2  0.0000
тж  2  0.0000
пё  2  0.0000
пэ  2  0.0000
нб  2  0.0000
кю  2  0.0000
кп  2  0.0000
км  2  0.0000
йв  2  0.0000
иэ  2  0.0000
зё  2  0.0000
зю  2  0.0000
жц  2  0.0000
гф  2  0.0000
гз  2  0.0000
вф  2  0.0000
вж  2  0.0000
бё  2  0.0000
бэ  2  0.0000
юф  1  0.0000
юа  1  0.0000
ээ  1  0.0000
эш  1  0.0000
ьэ  1  0.0000
ьщ  1  0.0000
ыу  1  0.0000
ъю  1  0.0000
чч  1  0.0000
чх  1  0.0000
чж  1  0.0000
ць  1  0.0000
цс  1  0.0000
цп  1  0.0000
цд  1  0.0000
цг  1  0.0000
хъ  1  0.0000
хк  1  0.0000
хд  1  0.0000
фё  1  0.0000
сэ  1  0.0000
пз  1  0.0000
пг  1  0.0000
пв  1  0.0000
пб  1  0.0000
нъ  1  0.0000
мю  1  0.0000
лш  1  0.0000
кы  1  0.0000
кч  1  0.0000
кб  1  0.0000
йх  1  0.0000
йп  1  0.0000
жю  1  0.0000
жп  1  0.0000
дэ  1  0.0000
гю  1  0.0000


|ст|то|не|но|на|по|ра|ет|ро|ка|во|ре|ко|ер|ть|ни|ен|ве|ос|ол|пр|от|ли|ор|та|го|ов|ом|те|ле|од|ой|ес|ло|ва|ак|ит|да|ал|ем|за|ла|де|ел|он|ри|ль|ме|ат|ны|ас|ан|ти|мо|тр|ам|че|ск|се|ог|об|ин|до|ав|бе|тв|ей|ки|ви|же|сл|ру|ар|бо|им|пе|вс|кр|чт|ты|из|ед|ми|ок|ад|ил|ис|нн|аз|ма|со|ди|вы|нь|ае|ив|их|ик|хо|ый|тс|ну|ше|ег|сь|па|ев|ус|ду|оч|ут|бы|уд|жи|ча|дн|св|гл|ез|ши|ож|ек|ту|зн|ку|чи|оз|сп|мн|сн|еб|ры|ще|пл|са|эт|лу|му|ах|гр|бу|зд|ий|ое|бр|мы|си|ид|еч|оп|гд|ых|шь|уж|лю|аю|ир|су|др|ум|тн|га|рт|вн|уг|зв|пу|пи|ье|жа|рн|иц|аж|лы|ие|иш|ым|чн|бл|см|ич|еп|ыл|ул|ыв|еж|щи|еш|ба|дв|ее|вр|уч|ца
			 */
		}
	}
}
